In [3]:
dict1 = {"column1": [1, 2, 3, 4],
         "column2": ["PW Skills", "PWIOI", "PW", "PW Wallah"]}

In [4]:
import pandas as pd

df = pd.DataFrame(dict1)
df

   column1    column2
0        1  PW Skills
1        2      PWIOI
2        3         PW
3        4  PW Wallah

In [6]:
df['column1']

0    1
1    2
2    3
3    4
Name: column1, dtype: int64

In [7]:
type(df)

pandas.core.frame.DataFrame

In [8]:
type(df['column1'])

pandas.core.series.Series

In [9]:
df[['column1', 'column2']]

   column1    column2
0        1  PW Skills
1        2      PWIOI
2        3         PW
3        4  PW Wallah

In [10]:
df['Column 3'] = [10, 20, 30, 40]

In [11]:
df

   column1    column2  Column 3
0        1  PW Skills        10
1        2      PWIOI        20
2        3         PW        30
3        4  PW Wallah        40

In [12]:
df.iloc[2, 2] # integer based indexing

30

In [13]:
df.iloc[0:3, 0:2]

   column1    column2
0        1  PW Skills
1        2      PWIOI
2        3         PW

In [16]:
df.loc[1, 'Column 3'] # label based indexing

20

In [17]:
df

   column1    column2  Column 3
0        1  PW Skills        10
1        2      PWIOI        20
2        3         PW        30
3        4  PW Wallah        40

In [18]:
df.loc[1:2, 'column2': 'Column 3']

  column2  Column 3
1   PWIOI        20
2      PW        30

# Key difference between iloc and loc

# Indexing type: 
    iloc uses integer-based indexing.
    loc uses label-based indexing.

# Inclusivity:
    iloc uses exclusive indexing {end index is not included in the range}.
    loc uses inclusive {end label is included in the range}.

# Handling non-numeric labels:
    iloc cannot handle non-numeric labels since it relies on integer positions.
    loc is designed to handle non-numeric (string or other) labels.

In [19]:
list1 = [11, 44, 66, 22]
list2 = ['Alex', "Cind", "Riya", "Sim"]

list(zip(list1, list2))

[(11, 'Alex'), (44, 'Cind'), (66, 'Riya'), (22, 'Sim')]

In [20]:
df2 = pd.DataFrame(list(zip(list1, list2)), columns=["Marks", "Student Name"])

In [21]:
df2

   Marks Student Name
0     11         Alex
1     44         Cind
2     66         Riya
3     22          Sim

In [23]:
new_df = pd.concat([df, df2])
new_df

   column1    column2  Column 3  Marks Student Name
0      1.0  PW Skills      10.0    NaN          NaN
1      2.0      PWIOI      20.0    NaN          NaN
2      3.0         PW      30.0    NaN          NaN
3      4.0  PW Wallah      40.0    NaN          NaN
0      NaN        NaN       NaN   11.0         Alex
1      NaN        NaN       NaN   44.0         Cind
2      NaN        NaN       NaN   66.0         Riya
3      NaN        NaN       NaN   22.0          Sim

In [24]:
new_df2 = pd.concat([df, df2], axis=1)
new_df2

   column1    column2  Column 3  Marks Student Name
0        1  PW Skills        10     11         Alex
1        2      PWIOI        20     44         Cind
2        3         PW        30     66         Riya
3        4  PW Wallah        40     22          Sim